app/views/workspaces/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."workspace_id" = $1  [["workspace_id", 1]]
---
    <h2>Average Rating: </h2>
    <p><span id="average_rating"></span> (<%= @reviews.count %> <%= @reviews.count != 1 ? "Reviews" : "Review" %>)</p>