app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("star", "comment", "workspace_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["star", 1], ["comment", "bad"], ["workspace_id", 1], ["user_id", 1], ["created_at", "2015-08-12 18:40:38.900097"], ["updated_at", "2015-08-12 18:40:38.900097"]]
---
  def create
    @review = Review.create(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
  def destroy
    @review = Review.find(params[:id])
    workspace = @review.workspace
    @review.destroy