app/controllers/workspaces_controller.rb

  def index
    # workspaces sorted by top rating

  @category = params[:category]
  @location = params[:location]

  @workspaces = Workspace

  if @category
    @workspaces = @workspaces.where(category: @category)
  end

  if @location
    @workspaces = @workspaces.where("address like '%#{@location}%'")
  end

  if @workspaces == Workspace
    @workspaces = Workspace.all
---
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."category" = $1  [["category", "Coffee Shop"]]

  def create
    @workspace = current_user.workspaces.build(workspace_params)

    if @workspace.save
---
INSERT INTO "workspaces" ("name", "address", "company_url", "category", "image_url", "hours", "wifi", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @workspace = Workspace.find(params[:id])

    @review = Review.new
    @reviews = @workspace.reviews

    # check to see if user has left a review
    @hasReview = @reviews.find_by(user_id: current_user.id) if current_user
---
SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."workspace_id" = $1 AND "reviews"."user_id" = $2 LIMIT 1  [["workspace_id", 1], ["user_id", 1]]